/*!
****************************************************************************************************
* 文件名称：devmanager.h
* 功能简介：该文件是设备管理器模块的接口头文件
* 文件作者：HQHP
* 创建日期：2023-01-30
* 版权声明：All Rights Reserved.
****************************************************************************************************
*/
#ifndef INCLUDE_HQHP_DEVMANAGER_H_
#define INCLUDE_HQHP_DEVMANAGER_H_

/*!
****************************************************************************************************
* 包含文件
****************************************************************************************************
*/
#include <hqhp/config.h>
#include <hqhp/defs.h>
#ifdef __cplusplus
extern "C" {
#endif

/*!
****************************************************************************************************
* 常量定义
****************************************************************************************************
*/
enum {
	DEVID_AI_G0, // 主板AI
	DEVID_AI_G1, // 扩展板1#AI
	DEVID_AI_G2	 // 扩展板2#AI
};

enum {
	DEVID_AO_G0, // 主板AO
	DEVID_AO_G1, // 扩展板1#AO
	DEVID_AO_G2	 // 扩展板2#AO
};

enum {
	DEVID_DI_G0, // 主板DI
	DEVID_DI_G1, // 扩展板1#DI
	DEVID_DI_G2	 // 扩展板2#DI
};

enum {
	DEVID_DO_G0, // 主板DO
	DEVID_DO_G1, // 扩展板1#DO
	DEVID_DO_G2	 // 扩展板2#DO
};

/*!
****************************************************************************************************
* 类型定义
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 全局变量
****************************************************************************************************
*/

/*!
****************************************************************************************************
* 接口函数
****************************************************************************************************
*/
void 	GPIOInit(void);
void 	DEVMGR_Handle(void);

void 	DEVMGR_AIInqChnValue(uint8_t aiGroup, float aiValues[16]);

uint16_t DEVMGR_DIGetBitsStatus(uint8_t diGroup);
void	DEVMGR_DOSetBitsStatus(uint8_t doGroup, uint16_t bitsStatus);

uint16_t DEVMGR_W25QRdDeviceID(void);
void	DEVMGR_W25QRdBytes(uint32_t addr, uint8_t* data, size_t bytes);
void	DEVMGR_W25QWrBytes(uint32_t addr, const uint8_t* data, size_t bytes);
void	DEVMGR_W25QWrBytesWithCheck(uint32_t addr, const uint8_t* data, size_t bytes);
void	DEVMGR_W25QEraseSector(uint32_t Dst_Addr);

/*!
****************************************************************************************************
* 内联函数
****************************************************************************************************
*/

#ifdef __cplusplus
}
#endif
#endif /* INCLUDE_HQHP_DEVMANAGER_H_ */
